src/backend/joanie/tests/payment/lyra/requests/tokenize_card.json

{
    "kr-hash-key": "password",
    "kr-hash-algorithm": "sha256_hmac",
    "kr-answer": "{\"shopId\":\"24388532\",\"orderCycle\":\"CLOSED\",\"orderStatus\":\"PAID\",\"serverDate\":\"2024-04-23T11:40:34+00:00\",\"orderDetails\":{\"orderTotalAmount\":0,\"orderEffectiveAmount\":0,\"orderCurrency\":\"EUR\",\"mode\":\"TEST\",\"orderId\":\"93e64f3a-6b60-475a-91e3-f4b8a364a844\",\"metadata\":null,\"_type\":\"V4/OrderDetails\"},\"customer\":{\"billingDetails\":{\"address\":\"65368 Ward Plain\",\"category\":null,\"cellPhoneNumber\":null,\"city\":\"West Deborahland\",\"country\":\"SK\",\"district\":null,\"firstName\":\"Elizabeth\",\"identityCode\":null,\"identityType\":null,\"language\":\"FR\",\"lastName\":\"Brady\",\"phoneNumber\":null,\"state\":null,\"streetNumber\":null,\"title\":null,\"zipCode\":\"05597\",\"legalName\":null,\"_type\":\"V4/Customer/BillingDetails\"},\"email\":\"nicolas.clerc@fun-mooc.fr\",\"reference\":\"607ce52d-71f5-4c33-b824-0430138048a2\",\"shippingDetails\":{\"address\":null,\"address2\":null,\"category\":null,\"city\":null,\"country\":null,\"deliveryCompanyName\":null,\"district\":null,\"firstName\":null,\"identityCode\":null,\"lastName\":null,\"legalName\":null,\"phoneNumber\":null,\"shippingMethod\":null,\"shippingSpeed\":null,\"state\":null,\"streetNumber\":null,\"zipCode\":null,\"_type\":\"V4/Customer/ShippingDetails\"},\"extraDetails\":{\"browserAccept\":null,\"fingerPrintId\":null,\"ipAddress\":\"86.221.55.189\",\"browserUserAgent\":\"Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:125.0) Gecko/20100101 Firefox/125.0\",\"_type\":\"V4/Customer/ExtraDetails\"},\"shoppingCart\":{\"insuranceAmount\":null,\"shippingAmount\":null,\"taxAmount\":null,\"cartItemInfo\":null,\"_type\":\"V4/Customer/ShoppingCart\"},\"_type\":\"V4/Customer/Customer\"},\"transactions\":[{\"shopId\":\"24388532\",\"uuid\":\"25ac387c5c534ad6ae6349b2a14d0070\",\"amount\":0,\"currency\":\"EUR\",\"paymentMethodType\":\"CARD\",\"paymentMethodToken\":\"1f0e70ebcc3545358489199776d901f9\",\"status\":\"PAID\",\"detailedStatus\":\"ACCEPTED\",\"operationType\":\"VERIFICATION\",\"effectiveStrongAuthentication\":\"DISABLED\",\"creationDate\":\"2024-04-23T11:40:31+00:00\",\"errorCode\":null,\"errorMessage\":null,\"detailedErrorCode\":null,\"detailedErrorMessage\":null,\"metadata\":null,\"transactionDetails\":{\"liabilityShift\":\"NO\",\"effectiveAmount\":0,\"effectiveCurrency\":\"EUR\",\"creationContext\":\"VERIFICATION\",\"cardDetails\":{\"paymentSource\":\"EC\",\"manualValidation\":\"NO\",\"expectedCaptureDate\":null,\"effectiveBrand\":\"CB\",\"pan\":\"497010XXXXXX0055\",\"expiryMonth\":12,\"expiryYear\":2025,\"country\":\"FR\",\"issuerCode\":null,\"issuerName\":\"Banque de demo et de l'innovation\",\"effectiveProductCode\":\"F\",\"legacyTransId\":\"9cwz7w\",\"legacyTransDate\":\"2024-04-23T11:40:31+00:00\",\"paymentMethodSource\":\"TOKEN\",\"authorizationResponse\":{\"amount\":null,\"currency\":null,\"authorizationDate\":null,\"authorizationNumber\":null,\"authorizationResult\":null,\"authorizationMode\":\"MARK\",\"_type\":\"V4/PaymentMethod/Details/Cards/CardAuthorizationResponse\"},\"captureResponse\":{\"refundAmount\":null,\"refundCurrency\":null,\"captureDate\":null,\"captureFileNumber\":null,\"effectiveRefundAmount\":null,\"effectiveRefundCurrency\":null,\"_type\":\"V4/PaymentMethod/Details/Cards/CardCaptureResponse\"},\"threeDSResponse\":{\"authenticationResultData\":{\"transactionCondition\":null,\"enrolled\":null,\"status\":null,\"eci\":null,\"xid\":null,\"cavvAlgorithm\":null,\"cavv\":null,\"signValid\":null,\"brand\":null,\"_type\":\"V4/PaymentMethod/Details/Cards/CardAuthenticationResponse\"},\"_type\":\"V4/PaymentMethod/Details/Cards/ThreeDSResponse\"},\"authenticationResponse\":{\"id\":\"6c725711-63b9-4831-8e33-66393a1a7e67\",\"operationSessionId\":null,\"protocol\":{\"name\":\"THREEDS\",\"version\":\"2.2.0\",\"network\":\"VISA\",\"challengePreference\":\"CHALLENGE_REQUESTED\",\"simulation\":true,\"_type\":\"V4/Charge/Authenticate/Protocol\"},\"value\":{\"authenticationType\":null,\"authenticationId\":null,\"authenticationValue\":null,\"status\":\"NOT_ENROLLED\",\"commerceIndicator\":null,\"extension\":{\"authenticationType\":\"THREEDS_V2\",\"challengeCancelationIndicator\":null,\"cbScore\":null,\"cbAvalgo\":null,\"cbExemption\":null,\"paymentUseCase\":null,\"threeDSServerTransID\":null,\"dsTransID\":null,\"acsTransID\":null,\"sdkTransID\":null,\"transStatusReason\":null,\"requestedExemption\":\"TECHNICAL_ERROR\",\"requestorName\":\"DEMO FUNMOOC JGS\",\"cardHolderInfo\":null,\"dataOnlyStatus\":null,\"dataOnlyDecision\":null,\"dataOnlyScore\":null,\"_type\":\"V4/Charge/Authenticate/AuthenticationResultExtensionThreedsV2\"},\"reason\":null,\"_type\":\"V4/Charge/Authenticate/AuthenticationResult\"},\"_type\":\"V4/AuthenticationResponseData\"},\"installmentNumber\":null,\"installmentCode\":null,\"markAuthorizationResponse\":{\"amount\":0,\"currency\":\"EUR\",\"authorizationDate\":\"2024-04-23T11:40:32+00:00\",\"authorizationNumber\":\"3fd70b\",\"authorizationResult\":\"0\",\"_type\":\"V4/PaymentMethod/Details/Cards/MarkAuthorizationResponse\"},\"cardHolderName\":null,\"cardHolderPan\":\"497010XXXXXX0055\",\"cardHolderExpiryMonth\":12,\"cardHolderExpiryYear\":2025,\"identityDocumentNumber\":null,\"identityDocumentType\":null,\"initialIssuerTransactionIdentifier\":\"2444727839617985\",\"productCategory\":\"DEBIT\",\"nature\":\"CONSUMER_CARD\",\"_type\":\"V4/PaymentMethod/Details/CardDetails\"},\"paymentMethodDetails\":{\"id\":\"497010XXXXXX0055\",\"paymentSource\":\"EC\",\"manualValidation\":\"NO\",\"expectedCaptureDate\":null,\"effectiveBrand\":\"CB\",\"expiryMonth\":12,\"expiryYear\":2025,\"country\":\"FR\",\"issuerCode\":null,\"issuerName\":\"Banque de demo et de l'innovation\",\"effectiveProductCode\":\"F\",\"legacyTransId\":\"9cwz7w\",\"legacyTransDate\":\"2024-04-23T11:40:31+00:00\",\"paymentMethodSource\":\"TOKEN\",\"authorizationResponse\":{\"amount\":null,\"currency\":null,\"authorizationDate\":null,\"authorizationNumber\":null,\"authorizationResult\":null,\"authorizationMode\":\"MARK\",\"_type\":\"V4/PaymentMethod/Details/Cards/CardAuthorizationResponse\"},\"captureResponse\":{\"refundAmount\":null,\"refundCurrency\":null,\"captureDate\":null,\"captureFileNumber\":null,\"effectiveRefundAmount\":null,\"effectiveRefundCurrency\":null,\"_type\":\"V4/PaymentMethod/Details/Cards/CardCaptureResponse\"},\"authenticationResponse\":{\"id\":\"6c725711-63b9-4831-8e33-66393a1a7e67\",\"operationSessionId\":null,\"protocol\":{\"name\":\"THREEDS\",\"version\":\"2.2.0\",\"network\":\"VISA\",\"challengePreference\":\"CHALLENGE_REQUESTED\",\"simulation\":true,\"_type\":\"V4/Charge/Authenticate/Protocol\"},\"value\":{\"authenticationType\":null,\"authenticationId\":null,\"authenticationValue\":null,\"status\":\"NOT_ENROLLED\",\"commerceIndicator\":null,\"extension\":{\"authenticationType\":\"THREEDS_V2\",\"challengeCancelationIndicator\":null,\"cbScore\":null,\"cbAvalgo\":null,\"cbExemption\":null,\"paymentUseCase\":null,\"threeDSServerTransID\":null,\"dsTransID\":null,\"acsTransID\":null,\"sdkTransID\":null,\"transStatusReason\":null,\"requestedExemption\":\"TECHNICAL_ERROR\",\"requestorName\":\"DEMO FUNMOOC JGS\",\"cardHolderInfo\":null,\"dataOnlyStatus\":null,\"dataOnlyDecision\":null,\"dataOnlyScore\":null,\"_type\":\"V4/Charge/Authenticate/AuthenticationResultExtensionThreedsV2\"},\"reason\":null,\"_type\":\"V4/Charge/Authenticate/AuthenticationResult\"},\"_type\":\"V4/AuthenticationResponseData\"},\"installmentNumber\":null,\"installmentCode\":null,\"markAuthorizationResponse\":{\"amount\":0,\"currency\":\"EUR\",\"authorizationDate\":\"2024-04-23T11:40:32+00:00\",\"authorizationNumber\":\"3fd70b\",\"authorizationResult\":\"0\",\"_type\":\"V4/PaymentMethod/Details/Cards/MarkAuthorizationResponse\"},\"cardHolderName\":null,\"cardHolderPan\":\"497010XXXXXX0055\",\"cardHolderExpiryMonth\":12,\"cardHolderExpiryYear\":2025,\"identityDocumentNumber\":null,\"identityDocumentType\":null,\"initialIssuerTransactionIdentifier\":\"2444727839617985\",\"_type\":\"V4/PaymentMethod/Details/PaymentMethodDetails\"},\"acquirerDetails\":null,\"fraudManagement\":{\"riskControl\":[],\"riskAnalysis\":[{\"score\":null,\"resultCode\":\"UNKNOWN\",\"status\":\"P_SEND_OK\",\"requestId\":\"12156fc9-87a7-4ace-bf8c-1695a62fd70e\",\"extraInfo\":[{\"key\":\"notoChannel\",\"value\":\"627228-24388532\",\"_type\":\"V4/PaymentMethod/Details/Risk/ExtInfo\"}],\"fingerPrintId\":null,\"_type\":\"V4/PaymentMethod/Details/Risk/RiskAnalysis\"}],\"riskAssessments\":null,\"_type\":\"V4/PaymentMethod/Details/FraudManagement\"},\"subscriptionDetails\":{\"subscriptionId\":null,\"_type\":\"V4/PaymentMethod/Details/SubscriptionDetails\"},\"parentTransactionUuid\":null,\"mid\":\"9900761\",\"sequenceNumber\":1,\"taxAmount\":null,\"preTaxAmount\":null,\"taxRate\":null,\"externalTransactionId\":null,\"dcc\":null,\"nsu\":null,\"tid\":\"001\",\"acquirerNetwork\":\"CB\",\"taxRefundAmount\":null,\"userInfo\":\"JS Client\",\"paymentMethodTokenPreviouslyRegistered\":null,\"occurrenceType\":\"RECURRENT_INITIAL\",\"archivalReferenceId\":\"L1149cwz7w01\",\"useCase\":null,\"wallet\":null,\"_type\":\"V4/TransactionDetails\"},\"_type\":\"V4/PaymentTransaction\"}],\"subMerchantDetails\":null,\"_type\":\"V4/Payment\"}",
    "kr-answer-type": "V4/Payment",
    "kr-hash": "05e916b87d26b4ec8d2107021dfca877677774cf85a6dc73f674e6abdf48754b"
}
