src/backend/joanie/tests/payment/lyra/responses/create_zero_click_payment.json

{
    "webService": "Charge/CreatePayment",
    "version": "V4",
    "applicationVersion": "6.15.0",
    "status": "SUCCESS",
    "answer": {
        "shopId": "24388532",
        "orderCycle": "CLOSED",
        "orderStatus": "PAID",
        "serverDate": "2024-04-25T08:33:40+00:00",
        "orderDetails": {
            "orderTotalAmount": 12345,
            "orderEffectiveAmount": 12345,
            "orderCurrency": "EUR",
            "mode": "TEST",
            "orderId": "2f3f527a-9f47-4a45-94d5-ad3ef0dbd437",
            "metadata": null,
            "_type": "V4/OrderDetails"
        },
        "customer": {
            "billingDetails": {
                "address": "65368 Ward Plain",
                "category": null,
                "cellPhoneNumber": null,
                "city": "West Deborahland",
                "country": "SK",
                "district": null,
                "firstName": "Elizabeth",
                "identityCode": null,
                "identityType": null,
                "language": "FR",
                "lastName": "Brady",
                "phoneNumber": null,
                "state": null,
                "streetNumber": null,
                "title": null,
                "zipCode": "05597",
                "legalName": null,
                "_type": "V4/Customer/BillingDetails"
            },
            "email": "nicolas.clerc@fun-mooc.fr",
            "reference": "607ce52d-71f5-4c33-b824-0430138048a2",
            "shippingDetails": {
                "address": null,
                "address2": null,
                "category": null,
                "city": null,
                "country": null,
                "deliveryCompanyName": null,
                "district": null,
                "firstName": null,
                "identityCode": null,
                "lastName": null,
                "legalName": null,
                "phoneNumber": null,
                "shippingMethod": null,
                "shippingSpeed": null,
                "state": null,
                "streetNumber": null,
                "zipCode": null,
                "_type": "V4/Customer/ShippingDetails"
            },
            "extraDetails": {
                "browserAccept": null,
                "fingerPrintId": null,
                "ipAddress": "86.221.55.189",
                "browserUserAgent": "python-requests/2.31.0",
                "_type": "V4/Customer/ExtraDetails"
            },
            "shoppingCart": {
                "insuranceAmount": null,
                "shippingAmount": null,
                "taxAmount": null,
                "cartItemInfo": null,
                "_type": "V4/Customer/ShoppingCart"
            },
            "_type": "V4/Customer/Customer"
        },
        "transactions": [
            {
                "shopId": "24388532",
                "uuid": "bed15ddb6c4a4046bbc96a07ff34a9ff",
                "amount": 12345,
                "currency": "EUR",
                "paymentMethodType": "CARD",
                "paymentMethodToken": "78b346b66bc5472fad3b7a1f72e3db9e",
                "status": "PAID",
                "detailedStatus": "AUTHORISED",
                "operationType": "DEBIT",
                "effectiveStrongAuthentication": "DISABLED",
                "creationDate": "2024-04-25T08:33:39+00:00",
                "errorCode": null,
                "errorMessage": null,
                "detailedErrorCode": null,
                "detailedErrorMessage": null,
                "metadata": null,
                "transactionDetails": {
                    "liabilityShift": "NO",
                    "effectiveAmount": 12345,
                    "effectiveCurrency": "EUR",
                    "creationContext": "CHARGE",
                    "cardDetails": {
                        "paymentSource": "EC",
                        "manualValidation": "NO",
                        "expectedCaptureDate": "2024-04-25T08:33:39+00:00",
                        "effectiveBrand": "CB",
                        "pan": "497010XXXXXX0055",
                        "expiryMonth": 12,
                        "expiryYear": 2025,
                        "country": "FR",
                        "issuerCode": null,
                        "issuerName": "Banque de demo et de l'innovation",
                        "effectiveProductCode": "F",
                        "legacyTransId": "9lb5de",
                        "legacyTransDate": "2024-04-25T08:33:39+00:00",
                        "paymentMethodSource": "TOKEN",
                        "authorizationResponse": {
                            "amount": 12345,
                            "currency": "EUR",
                            "authorizationDate": "2024-04-25T08:33:40+00:00",
                            "authorizationNumber": "3fbcfe",
                            "authorizationResult": "0",
                            "authorizationMode": "FULL",
                            "_type": "V4/PaymentMethod/Details/Cards/CardAuthorizationResponse"
                        },
                        "captureResponse": {
                            "refundAmount": null,
                            "refundCurrency": null,
                            "captureDate": null,
                            "captureFileNumber": null,
                            "effectiveRefundAmount": null,
                            "effectiveRefundCurrency": null,
                            "_type": "V4/PaymentMethod/Details/Cards/CardCaptureResponse"
                        },
                        "threeDSResponse": {
                            "authenticationResultData": {
                                "transactionCondition": null,
                                "enrolled": null,
                                "status": null,
                                "eci": null,
                                "xid": null,
                                "cavvAlgorithm": null,
                                "cavv": null,
                                "signValid": null,
                                "brand": null,
                                "_type": "V4/PaymentMethod/Details/Cards/CardAuthenticationResponse"
                            },
                            "_type": "V4/PaymentMethod/Details/Cards/ThreeDSResponse"
                        },
                        "authenticationResponse": null,
                        "installmentNumber": null,
                        "installmentCode": null,
                        "markAuthorizationResponse": {
                            "amount": null,
                            "currency": null,
                            "authorizationDate": null,
                            "authorizationNumber": null,
                            "authorizationResult": null,
                            "_type": "V4/PaymentMethod/Details/Cards/MarkAuthorizationResponse"
                        },
                        "cardHolderName": null,
                        "cardHolderPan": "497010XXXXXX0055",
                        "cardHolderExpiryMonth": 12,
                        "cardHolderExpiryYear": 2025,
                        "identityDocumentNumber": null,
                        "identityDocumentType": null,
                        "initialIssuerTransactionIdentifier": "4575676657929351",
                        "productCategory": "DEBIT",
                        "nature": "CONSUMER_CARD",
                        "_type": "V4/PaymentMethod/Details/CardDetails"
                    },
                    "paymentMethodDetails": {
                        "id": "497010XXXXXX0055",
                        "paymentSource": "EC",
                        "manualValidation": "NO",
                        "expectedCaptureDate": "2024-04-25T08:33:39+00:00",
                        "effectiveBrand": "CB",
                        "expiryMonth": 12,
                        "expiryYear": 2025,
                        "country": "FR",
                        "issuerCode": null,
                        "issuerName": "Banque de demo et de l'innovation",
                        "effectiveProductCode": "F",
                        "legacyTransId": "9lb5de",
                        "legacyTransDate": "2024-04-25T08:33:39+00:00",
                        "paymentMethodSource": "TOKEN",
                        "authorizationResponse": {
                            "amount": 12345,
                            "currency": "EUR",
                            "authorizationDate": "2024-04-25T08:33:40+00:00",
                            "authorizationNumber": "3fbcfe",
                            "authorizationResult": "0",
                            "authorizationMode": "FULL",
                            "_type": "V4/PaymentMethod/Details/Cards/CardAuthorizationResponse"
                        },
                        "captureResponse": {
                            "refundAmount": null,
                            "refundCurrency": null,
                            "captureDate": null,
                            "captureFileNumber": null,
                            "effectiveRefundAmount": null,
                            "effectiveRefundCurrency": null,
                            "_type": "V4/PaymentMethod/Details/Cards/CardCaptureResponse"
                        },
                        "authenticationResponse": null,
                        "installmentNumber": null,
                        "installmentCode": null,
                        "markAuthorizationResponse": {
                            "amount": null,
                            "currency": null,
                            "authorizationDate": null,
                            "authorizationNumber": null,
                            "authorizationResult": null,
                            "_type": "V4/PaymentMethod/Details/Cards/MarkAuthorizationResponse"
                        },
                        "cardHolderName": null,
                        "cardHolderPan": "497010XXXXXX0055",
                        "cardHolderExpiryMonth": 12,
                        "cardHolderExpiryYear": 2025,
                        "identityDocumentNumber": null,
                        "identityDocumentType": null,
                        "initialIssuerTransactionIdentifier": "4575676657929351",
                        "_type": "V4/PaymentMethod/Details/PaymentMethodDetails"
                    },
                    "acquirerDetails": null,
                    "fraudManagement": {
                        "riskControl": [],
                        "riskAnalysis": [],
                        "_type": "V4/PaymentMethod/Details/FraudManagement"
                    },
                    "subscriptionDetails": {
                        "subscriptionId": null,
                        "_type": "V4/PaymentMethod/Details/SubscriptionDetails"
                    },
                    "parentTransactionUuid": null,
                    "mid": "9900761",
                    "sequenceNumber": 1,
                    "taxAmount": null,
                    "preTaxAmount": null,
                    "taxRate": null,
                    "externalTransactionId": null,
                    "nsu": null,
                    "tid": "001",
                    "acquirerNetwork": "CB",
                    "taxRefundAmount": null,
                    "userInfo": null,
                    "paymentMethodTokenPreviouslyRegistered": null,
                    "occurrenceType": "RECURRENT_INTERMEDIAIRE",
                    "archivalReferenceId": "L1169lb5de01",
                    "useCase": null,
                    "wallet": null,
                    "_type": "V4/TransactionDetails"
                },
                "_type": "V4/PaymentTransaction"
            }
        ],
        "subMerchantDetails": null,
        "_type": "V4/Payment"
    },
    "ticket": "e04b792e124044998e6dcc5eae9cf6a8",
    "serverDate": "2024-04-25T08:33:40+00:00",
    "applicationProvider": "LYRA",
    "metadata": null,
    "mode": "TEST",
    "serverUrl": "https://api.lyra.com",
    "_type": "V4/WebService/Response"
}
